{
  general: {
    maxHp: 36,
    ac: 14,
    characterName: "Gordon Goldwhistle",
    hitDieMax: "5 D8",
    background: "Criminal",
    species: "Halfling",
    className: "Rogue",
    subclass: "Arcane Trickster",
    level: 5,
    xp: 0
  },
  basestats: {
    proficiencyBonus: 4,
    initiative: 5,
    speed: "30 ft",
    size: "small",
    carryCapacity: 180,
    passivePerception: 11,
    spellcastingModifier: 3,
    spellSaveDc: 14,
    spellAttackBonus: 6,
  },
  stats: {
    strength: {
      stat: 12,
      abilities: {
        save: 0,
        athletics: 0
      }
    },
    dexterity: {
      stat: 17,
      abilities: {
        save: 1,
        acrobatics: 1,
        sleightOfHand: 1,
        stealth: 2
      }
    },
    constitution: {
      stat: 15,
      abilities: {
        save: 0,
      }
    },
    intelligence: {
      stat: 12,
      abilities: {
        save: 0,
        arcana: 0,
        history: 0,
        religion: 0,
        investigation: 1,
        nature: 0
      }
    },
    wisdom: {
      stat: 13,
      abilities: {
        save: 0,
        insight: 1,
        perception: 2,
        animalHandling: 0,
        medicine: 0,
        survival: 0
      }
    },
    charisma: {
      stat: 19,
      abilities: {
        save: 0,
        deception: 1,
        intimidation: 0,
        persuasion: 0,
        performance: 1
      }
    },
  },
  usables: {
    waterskin: {
      uses: 1,
      desc: "Holds a gallon of water (liquid)"
    },
    heroicInspiration: {
      uses: 1,
      desc: "reroll a d20 (can also be gifted to allies)"
    },
    giftOfTheChromaticDragonDamage: {
      uses: 1,
      desc: "Can infuse weapon with dmg"
    },
    giftOfTheChromaticDragonResistance: {
      uses: 2,
      desc: "Can use a reaction to gain resistance to a certain dmg-type"
    },
  },
  misc: {
    cunningAction: "Can use Dash, Disengage and Hide as a bonus action",
    uncunnyDodge: "Use reaction to halve dmg taken",
    cunningStrike: "You've developed cunning ways to use your Sneak Attack. When you deal Sneak Attack damage, you can add one of the following Cunning Strike effects.\nEach effect has a die cost, which is the number of Sneak Attack damage dice you must forgo to add the effect. You remove the die before rolling, and the effect occurs immediately after the attack's damage is dealt. For example, if you add the Poison effect, remove 1d6 from the Sneak Attack's damage before rolling.\nIf a Cunning Strike effect requires a saving throw, the DC equals 8 plus your Dexterity modifier and Proficiency Bonus.\nPoison (Cost: 1d6). You add a toxin to your strike, forcing the target to make a Constitution saving throw. On a failed save, the target has the Poisoned condition for 1 minute. At the end of each of its turns, the Poisoned target repeats the save, ending the effect on itself on a success.\nTo use this effect, you must have a Poisoner's Kit on your person.\nTrip (Cost: Id6). If the target is Large or smaller, it must succeed on a Dexterity saving throw or have the Prone condition.\nWithdraw (Cost: 1d6). Immediately after the at-tack, you move up to half your Speed without provoking Opportunity Attacks.",
    sharpshooter: "Ignore half- and three-quarters-cover. No Disadvantage when using a ranged weapon within 5ft of an enemy. No Disadvantage at long range.",
    brave: "Advantage on saving throws to avoid or end Frightened.",
    steadyAim: "Gain Advantage on an attack role as a bonus action. reduces speed to 0",
    halflingNimbleness: "Move through spaces occupied by any creature larger than you.",
    luck: "can reroll D20 if first roll is a 1",
    naturallyStealthy: "Can take hide action when obscured by  creature larger than you.",
    alert: "Can Swap Initiative with ally. Is Proficient in Initiative",
    appearance: "Schiefe Nase",
    backstory: "Bande",
    languages: "Common, Thieves Cant, Halfling",
    concentration: "Some spells and other effects require Concentration to remain active, as specified in their descriptions.\n\n If the effect's creator loses Concentration, the effect ends. If the effect has a maximum duration, the effect's description specifies how long the creator can concentrate on it: up to 1 minute, 1 hour, or some other duration. The creator can end Concentration at any time (no action required). The following factors break Concentration.\n\n Another Concentration Effect. You lose Concentration on an effect the moment you start casting a spell that requires Concentration or activate another effect that requires Concentration.\n\n Damage. If you take damage, you must succeed on a Constitution saving throw to maintain Concen-tration. The DC equals 10 or half the damage taken (round down), whichever number is higher, up to a maximum DC of 30.\n\n Incapacitated or Dead. Your Concentration ends if you have the Incapacitated condition or you die.",
    actions: "Attack, Dash, Disengage, Dodge, Help, Hide, Influence, Magic, Ready, Search, Study, Utilize\n \nATTACK [ACTION]\n When you take the Attack action, you can make one attack roll with a weapon or an Unarmed Strike. Equipping and Unequipping Weapons. You can either equip or unequip one weapon when you make an attack as part of this action. You do so either before or after the attack. If you equip a weapon before an attack, you don't need to use it for that at-tack. Equipping a weapon includes drawing it from a sheath or picking it up. Unequipping a weapon includes sheathing, stowing, or dropping it. Moving between Attacks. If you move on your turn and have a feature, such as Extra Attack, that gives you more than one attack as part of the Attack ac-tion, you can use some or all of that movement to move between those attacks. \nDASH [ACTION]\n When you take the Dash action, you gain extra movement for the current turn. The increase equals your Speed after applying any modifiers. With a Speed of 30 feet, for example, you can move up to 60 feet on your turn if you Dash. If your Speed of 30 feet is reduced to 15 feet, you can move up to 30 feet this turn if you Dash. If you have a special speed, such as a Fly Speed or Swim Speed, you can use that speed instead of your Speed when you take this action. You choose which speed to use each time you take it. See also \"Speed.\" \nDISENGAGE [ACTION]\n If you take the Disengage action, your movement doesn't provoke Opportunity Attacks for the rest of the current turn. \nDODGE [ACTION\n If you take the Dodge action, you gain the following benefits: until the start of your next turn, any attack roll made against you has Disadvantage if you can see the attacker, and you make Dexterity saving throws with Advantage. You lose these benefits if you have the Incapacitated condition or if your Speed is O. \nHELP [ACTION]\n When you take the Help action, you do one of the following. Assist an Ability Check. Choose one of your skill or tool proficiencies and one ally who is near enough for you to assist verbally or physically when they make an ability check. That ally has Advantage on the next ability check they make with the chosen skill or tool. This benefit expires if the ally doesn't use it before the start of your next turn. The DM has final say on whether your assistance is possible. Assist an Attack Roll. You momentarily distract an enemy within 5 feet of you, giving Advantage to the next attack roll by one of your allies against that enemy. This benefit expires at the start of your next turn. \nHIDE [ACTION]\n With the Hide action, you try to conceal yourself. To do so, you must succeed on a DC 15 Dexterity (Stealth) check while you're Heavily Obscured or behind Three-Quarters Cover or Total Cover, and you must be out of any enemy's line of sight; if you can see a creature, you can discern whether it can see you. On a successful check, you have the Invisible con-dition. Make note of your check's total, which is the DC for a creature to find you with a Wisdom (Per-ception) check. \nINFLUENCE [ACTION]\n With the Influence action, you urge a monster to do something. Describe or roleplay how you're communicating with the monster. Are you trying to deceive, intimidate, amuse, or gently persuade? The DM then determines whether the monster feels willing, unwilling, or hesitant due to your interac-tion; this determination establishes whether an ability check is necessary, as explained below. Willing. If your urging aligns with the monster's desires, no ability check is necessary; the monster fulfills your request in a way it prefers. Unwilling. If your urging is repugnant to the monster or counter to its alignment, no ability check is necessary; it doesn't comply. Hesitant. If you urge the monster to do something that it is hesitant to do, you must make an ability check, which is affected by the monster's attitude: Indifferent, Friendly, or Hostile, each of which is defined in this glossary. The Influence Checks table suggests which ability check to make based on how you're interacting with the monster. The DM chooses the check, which has a default DC equal to 15 or the monster's Intelligence score, whichever is higher. On a successful check, the monster does as urged. On a failed check, you must wait 24 hours (or a duration set by the DM) before urging it in the same way again. \nMAGIC [ACTION]\n When you take the Magic action, you cast a spell that has a casting time of an action or use a feature or magic item that requires a Magic action to be activated. If you cast a spell that has a casting time of 1 minute or longer, you must take the Magic action on each turn of that casting, and you must maintain Concentration while you do so. If your Concentration is broken, the spell fails, but you don't expend a spell slot. See also \"Concentration.\" \nREADY [ACTION]\n You take the Ready action to wait for a particular circumstance before you act. To do so, you take this action on your turn, which lets you act by taking a Reaction before the start of your next turn. First, you decide what perceivable circumstance will trigger your Reaction. Then, you choose the action you will take in response to that trigger, or you choose to move up to your Speed in response to it. Examples include \"If the cultist steps on the trapdoor, I'll pull the lever that opens it,\" and \"If the zombie steps next to me, I move away.\" When the trigger occurs, you can either take your Reaction right after the trigger finishes or ignore the trigger. When you Ready a spell, you cast it as normal (ex-pending any resources used to cast it) but hold its energy, which you release with your Reaction when the trigger occurs. To be readied, a spell must have a casting time of an action, and holding on to the spell's magic requires Concentration, which you can maintain up to the start of your next turn. If your Concentration is broken, the spell dissipates without taking effect. \nSEARCH [ACTION]\n When you take the Search action, you make a Wisdom check to discern something that isn't obvious. The Search table suggests which skills are applicable when you take this action, depending on what you're trying to detect. \nSTUDY [ACTION]\n When you take the Study action, you make an Intelligence check to study your memory, a book, a clue, or another source of knowledge and call to mind an important piece of information about it. The Areas of Knowledge table suggests which skills are applicable to various areas of knowledge. \nUTILIZE [ACTION]\n You normally interact with an object while doing something else, such as when you draw a sword as part of the Attack action. When an object requires an action for its use, you take the Utilize action.",
    conditions: "Blinded, Charmed, Deafened, Exhaustion, Frightened, Grappled, Incapacitated, Invisible, Paralyzed, Petrified, Poisoned, Prone, Restrained, Stunned, Unconscious\n\nBLINDED [CONDITION]\n While you have the Blinded condition, you experience the following effects. Can't See. You can't see and automatically fail any ability check that requires sight. Attacks Affected. Attack rolls against you have Advantage, and your attack rolls have Disadvantage. \nCHARMED [CONDITION]\n While you have the Charmed condition, you experience the following effects. Can't Harm the Charmer. You can't attack the charmer or target the charmer with damaging abilities or magical effects. Social Advantage. The charmer has Advantage on any ability check to interact with you socially. \nDEAFENED [CONDITION]\n While you have the Deafened condition, you experience the following effect. Can't Hear. You can't hear and automatically fail any ability check that requires hearing. \nEXHAUSTION [CONDITION]\n While you have the Exhaustion condition, you experience the following effects. Exhaustion Levels. This condition is cumulative. Each time you receive it, you gain 1 Exhaustion level. You die if your Exhaustion level is 6. D20 Tests Affected. When you make a D20 Test, the roll is reduced by 2 times your Exhaustion level. Speed Reduced. Your Speed is reduced by a number of feet equal to 5 times your Exhaustion level. Removing Exhaustion Levels. Finishing a Long Rest removes 1 of your Exhaustion levels. When your Exhaustion level reaches 0, the condition ends. \nFRIGHTENED [CONDITION]\n While you have the Frightened condition, you experience the following effects. Ability Checks and Attacks Affected. You have Disadvantage on ability checks and attack rolls while the source of fear is within line of sight. Can't Approach. You can't willingly move closer to the source of fear. \nGRAPPLED [CONDITION]\n While you have the Grappled condition, you experience the following effects. Speed O. Your Speed is O and can't increase. Attacks Affected. You have Disadvantage on attack rolls against any target other than the grappler. Movable. The grappler can drag or carry you when it moves, but every foot of movement costs it 1 extra foot unless you are Tiny or two or more sizes smaller than it. \nINCAPACITATED [CONDITION]\n While you have the Incapacitated condition, you experience the following effects. Inactive. You can't take any action, Bonus Action, or Reaction. No Concentration. Your Concentration is broken. Speechless. You can't speak. Surprised. If you're Incapacitated when you roll Initiative, you have Disadvantage on the roll. \nINVISIBLE [CONDITION]\n While you have the Invisible condition, you experience the following effects. Surprise. If you're Invisible when you roll Initia-tive, you have Advantage on the roll. Concealed. You aren't affected by any effect that requires its target to be seen unless the effect's creator can somehow see you. Any equipment you are wearing or carrying is also concealed. Attacks Affected. Attack rolls against you have Disadvantage, and your attack rolls have Advan-tage. If a creature can somehow see you, you don't gain this benefit against that creature. \nPARALYZED [CONDITION]\n While you have the Paralyzed condition, you experience the following effects. Incapacitated. You have the Incapacitated condition. Speed 0. Your Speed is 0 and can't increase. Saving Throws Affected. You automatically fail Strength and Dexterity saving throws. Attacks Affected. Attack rolls against you have Advantage. Automatic Critical Hits. Any attack roll that hits you is a Critical Hit if the attacker is within 5 feet of you. \nPETRIFIED [CONDITION]\n While you have the Petrified condition, you experience the following effects. Turned to Inanimate Substance. You are trans-formed, along with any nonmagical objects you are wearing and carrying, into a solid inanimate substance (usually stone). Your weight increases by a factor of ten, and you cease aging. Incapacitated. You have the Incapacitated condition. Speed 0. Your Speed is 0 and can't increase. Attacks Affected. Attack rolls against you have Advantage. Saving Throws Affected. You automatically fail Strength and Dexterity saving throws. Resist Damage. You have Resistance to all damage. Poison Immunity. You have Immunity to the Poisoned condition. \nPOISONED [CONDITION]\n While you have the Poisoned condition, you experience the following effect. Ability Checks and Attacks Affected. You have Disadvantage on attack rolls and ability checks. \nRESTRAINED [CONDITION]\n While you have the Restrained condition, you experience the following effects. Speed 0. Your Speed is 0 and can't increase. Attacks Affected. Attack rolls against you have Advantage, and your attack rolls have Disadvantage. Saving Throws Affected. You have Disadvantage on Dexterity saving throws. \nSTUNNED [CONDITION]\n While you have the Stunned condition, you experience the following effects. Incapacitated. You have the Incapacitated condition. Saving Throws Affected. You automatically fail Strength and Dexterity saving throws. Attacks Affected. Attack rolls against you have Advantage. \nUNCONSCIOUS [CONDITION]\n While you have the Unconscious condition, you experience the following effects. Inert. You have the Incapacitated and Prone conditions, and you drop whatever you're holding. When this condition ends, you remain Prone. Speed 0. Your Speed is 0 and can't increase. Attacks Affected. Attack rolls against you have Advantage. Saving Throws Affected. You automatically fail Strength and Dexterity saving throws. Automatic Critical Hits. Any attack roll that hits you is a Critical Hit if the attacker is within 5 feet of you. Unaware. You're unaware of your surroundings.",
    weaponMastery: "Shortbow: Vex - If you hit and deal damage, you have advantage on your next attack roll (until the end of your next turn).\n Dagger: Nick - If you make an extra attack using the light property you can make it as a part of your action."
  },
  equipment: [
    {name: "Perfume", weight: 0, quantity: 1, worth: "5gp"},
    {name: "Fine Clothes", weight: 6, quantity: 1, worth: "15gp"},
    {name: "Fine Clothes (2)", weight: 10, quantity: 1, worth: "25gp"},
    {name: "Playing Cards", weight: 0, quantity: 1, worth: "5sp"},
    {name: "Dagger", weight: 1, quantity: 2, worth: "2gp"},
    {name: "Arcane Focus (Ring)", weight: 0, quantity: 1, worth: "-"},
    {name: "Backpack", weight: 5, quantity: 1, worth: "2gp"},
    {name: "Caltrops", weight: 2, quantity: 1, worth: "1gp"},
    {name: "Crowbar", weight: 5, quantity: 1, worth: "2gp"},
    {name: "Oil", weight: 1, quantity: 2, worth: "1sp"},
    {name: "Rope", weight: 5, quantity: 1, worth: "1gp"},
    {name: "Tinderbox", weight: 1, quantity: 1, worth: "5sp"},
    {name: "Torches", weight: 1, quantity: 6, worth: "1cp"},
    {name: "Waterskin", weight: 5, quantity: 1, worth: "2sp"},
    {name: "Ring (Oma)", weight: 0, quantity: 1, worth: "-"},
    {name: "Bedroll", weight: 7, quantity: 1, worth: "1gp"},
    {name: "Ration", weight: 2, quantity: 4, worth: "5sp"},
    {name: "Book", weight: 5, quantity: 1, worth: "25gp"},
    {name: "PgM", weight: 0.5, quantity: 1, worth: "-"},
    {name: "PoH", weight: 0.5, quantity: 1, worth: "50gp"},
    {name: "Nachtschatten Zunge (PoH)", weight: 0.5, quantity: 1, worth: "-"},
    {name: "dust of sneezing", weight: 0, quantity: 1, worth: "-"},
    {name: "Walking Stick", weight: 5, quantity: 1, worth: "-"},
    {name: "Knöpfe", weight: 0, quantity: 7, worth: "-"},
  ],
  coins: {cp: 144, sp: 65, ep: 0, gp: 115, pp: 0},
  spellslots: {level1: 3},
  spells: {
    message: {
      desc: "You point toward a creature within range and whisper a message. The target (and only the target) hears the message and can reply in a whisper that only you can hear. You can cast this spell through solid objects if you are familiar with the target and know it is beyond the barrier. Magical silence; 1 foot of stone, metal, or wood; or a thin sheet of lead blocks the spell.",
      attributes: {
        level: 0,
        castingTime: "A",
        range: 120,
        requirements: "-S",
        misc: "1 round"
      }
    },
    mageHand: {
      desc: "A spectral, floating hand appears at a point you choose within range. The hand lasts for the dura-tion. The hand vanishes if it is ever more than 30 feet away from you or if you cast this spell again.When you cast the spell, you can use the hand to manipulate an object, open an unlocked door or container, stow or retrieve an item from an open container, or pour the contents out of a vial. As a Magic action on your later turns, you can control the hand thus again. As part of that action, you can move the hand up to 30 feet. The hand can't attack, activate magic items, or carry more than 10 pounds.",
      attributes: {
        level: 0,
        castingTime: "A",
        range: 30,
        requirements: "-VS",
        misc: "1 min"
      }
    },
    minorIllusion: {
      desc: "You create a sound or an image of an object within range that lasts for the duration. See the descriptions below for the effects of each. The illusion ends if you cast this spell again. If a creature takes a Study action to examine the sound or image, the creature can determine that it is an illusion with a successful Intelligence (Investi-gation) check against your spell save DC. If a creature discerns the illusion for what it is, the illusion becomes faint to the creature.\n Sound. If you create a sound, its volume can range from a whisper to a scream. It can be your voice, someone else's voice, a lion's roar, a beating of drums, or any other sound you choose. The sound continues unabated throughout the duration, or you can make discrete sounds at different times before the spell ends.\n Image. If you create an image of an object-such as a chair, muddy footprints, or a small chest-it must be no larger than a 5-foot Cube. The image can't create sound, light, smell, or any other sensory effect. Physical interaction with the image reveals it to be an illusion, since things can pass through it.",
      attributes: {
        level: 0,
        castingTime: "A",
        range: 30,
        requirements: "-S",
        misc: "1 min"
      }
    },
    sleep: {
      desc: "Each creature of your choice in a 5-foot-radius Sphere centered on a point within range must succeed on a Wisdom saving throw or have the Incapacitated condition until the end of its next turn, at which point it must repeat the save. If the target fails the second save, the target has the Unconscious condition for the duration. The spell ends on a target if it takes damage or someone within 5 feet of it takes an action to shake it out of the spell's effect. Creatures that don't sleep, such as elves, or that have Immunity to the Exhaustion condition automatically succeed on saves against this spell.",
      attributes: {
        level: 1,
        castingTime: "A",
        range: 60,
        requirements: "C-VS",
        misc: "5ft radius, 1 min"
      }
    },
  }
}
